# GradientNoise Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Gradient..::..GradientNoise Property
Gradient Class See Also
---
The property labeled "Noise Type" from the "Gradient" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GradientNoise { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GradientNoise As String
	Get
```

Visual C++
---
```text
public:
static property String^ GradientNoise {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "GradientNoiseType".
# See Also
Gradient Class
Autodesk.Revit.DB.Visual Namespace